1. Prepare for a Match:
Flip a coin: A. Winner chooses tableside or first serve, B. Loser gets remaining option and pays first.
2. The Serve:
After assuring opponents are ready, serve through the serving hole.
3. Subsequent Serves:
Served by team: A. Last scored upon, B. Lost last game.
4. Ball in Play:
Remains in play until: A. off the table, B. declared dead, C. time out is called, D. a point is scored.
5. Ball Off the Table:
If the ball touches: A. scoring marker, B. top of the side rail, C. any “non-table” object. (The serving
cup is considered “in play”.) Original serving team re-serves the ball or the goalie puts into play if
the goalie caused the ball to leave the table.
6. Dead Ball:
Ball stops moving out of reach of any play figures. A. Re-served by original server or B. if in goal
area, put into play by the goalie. Penalty: Balls intentionally made dead are re-served by the opponent.
7. Time Out:
Both teams have two-30 second timeouts per game. If ball not in play, either team may request. If in
play only by team in possession, and ball stopped. Either team may: A. take the full 30 seconds, B. switch positions ONCE. Penalty: More then two time outs is a Technical Foul.
8. Resuming Play After Time Out:
Ball must move and touch 2 play figures then stop for 1 full second before resuming play. Time limit starts 1 second after touching the 2nd play figure. Penalty: Opponent may continue play or re-serve.
9. Official Time out:
Either team may request when ball is stopped or dead. Does not count as a team timeout. Used to
request a referee, removed foreign objects from table, repair table, correct lighting etc. Penalty:
Requests made while the ball is in play and moving or as a team shoots or passes is a distraction.
10. Point Scored:
A.  Any legally scored ball counts (even if it goes into and out of the goal). B.  If both teams agree a
point was scored but not marked up and if no other point was scored, it shall be marked up.
11. Table Sides:
60 sec. is allowed to change sides between games. Penalty: Delay of game.
12. Change of Positions:
Teammates may switch positions only: A. during a time out, B. between points, C. between games, D.
before and/or after a technical foul shots. Penalty: Distraction.
13. Spinning the Rods:
Rotating a rod more then 360 degrees before or after advancing the ball is illegal (excessive
spinning may be a distraction). Penalty: A.  If ball scores, no point, opposing goalie puts ball into play. B. Otherwise, opponents may continue play or re-serve.
14. Jarring:
Any jarring, lifting or sliding the table. Penalty: A. First and Second: Warning, continue play from
current position, point of infraction, on rod jarred, or re-serve. B. Third: Technical foul and earlier
options.
15. Reset:
Defense disturbing the ball while offense is preparing to shoot or pass, even if the ball only rocks in
place. Penalty: A. All violations reset time limits and wall counts. B. One free “Reset” per game. C.
Subsequent resets during the SAME POINT. First:  “Reset Warning”: Second: Technical foul. D. Next reset following a technical foul is “reset warning” again. E. Offence faking a reset is opponent’s reserve.
16. Reaching Into the Playing Area:
During a dead ball, no penalty. Penalty: A. While in possession and stopped: opponents
re-serve. B. Moving in goal area or perched on goal: point scored. C. Any other time: Technical
foul.
17. Alterations to the Table:
A. Request for a new ball, okay, if ball is bad. B. Table repairs okay, if sudden failure. C. Players
may use grips and/or rosin, but it can’t get on the table. D. Illegal to alter the table in any other way.
18. Distractions:
Movement or sounds, made away from the rod(s) “playing” the ball, which could distract the players.
Penalty: A. Offense distracts: No point scores, opponent’s re-serve. B. Other cases: Distracted
team may, continue play, continue from point of distraction or re-serve ball.
19. Practice:
Practicing with a ball during a match (eg, practicing serve or pass). Penalty: Technical Foul.
20. Language:
Cursing, unsportsman comments or calling attention away from game (coaching during time outs/between games only). Penalty: A. Cursing: technical foul, B. Other: referee discretion; warning or technical foul.
21. Passing:
5-bar to 3-bar and goalie area to 5-bar:
Stopped or pinned balls must be put in motion and touch two play figures before being passed.
5-bar to 3-bar only:
A. 2 wall touches allowed, ball may touch wall a 3rd time as part of the pass. B. “Adjusting” the balls motion with the front or back of the “passing” play figure is illegal. Penalty: Opponent may continue play or re-serve the ball.
22. Time of Possession:
10 Seconds allowed on 5-bar, 15 Seconds any other area. Penalty: A. Exceeded on 3-bar, opposing goalie puts ball in play. B. All other areas, opponent re-serves the ball.
23. Match Time Limit:
Best of 5 is 1 hour, best of 3 is 35 min. Penalty: A. Overtime of 10 min. imposed. B. After overtime winner is: 1. Most games won, 2. (if tied) Most points scored, 3. (if tied) one point sudden death.
24. Delay of Game:
If team is not ready to play after 10 Seconds. Penalty: A. First-Warning. B. Subsequent-Time out charged.
25. Forfeiture/Recall:
When match is announced teams have 3 min. to start play. Penalty: A. First recall of 3 min. is a warning.  B. Each 3 min. recall after is loss of a game.
26. Technical Foul:
Flagrant or intentional violation of the rules. Note: Teams may switch position before and after a technical foul shot. Penalty: A. Stop play immediately, B. one shot from the 3-bar on goal, C. resume play from position stopped (point or no point). D. Third Technical in any one game is a forfeit.
27. Rules Decisions and Appeals:
A. If an official present: No arguing allowed (rule clarifications are acceptable). B. If no official
present: Official makes the most equitable decision possible. C. Appeals made to the Head Official.
28. Code of Ethics:
Unsportsman/unethical conduct is grounds for removal from tournament area.
29. Tournament Director:
A. Makes all decisions on tournament play, organization and appoints the head official. B. Head Official: Appoints officials, determines rules of play and handles all appeals.
